<a href="https://colab.research.google.com/github/leenago/Self_studying/blob/master/Statistics/statistics_3%EC%9E%A5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### 1. 리스트를 활용한 데이터프레임 생성

In [1]:
import pandas as pd

In [2]:
columns_list = ['고객이름','나이','등급']
value_list = [['James',26,'Silver'],['JIn',25,'Gold'],['Soo',28,'Vip']]

a = pd.DataFrame(data=value_list, columns= columns_list)
a

    고객이름  나이      등급
0  James  26  Silver
1    JIn  25    Gold
2    Soo  28     Vip

### 2. 딕셔너리를 활용한 데이터프레임 생성

In [3]:
dict = {'고객이름': ['James','Jin','Soo'], '나이':[26,25,28],'등급':['Silver','Gold','Vip']}
a = pd.DataFrame(dict)
a

    고객이름  나이      등급
0  James  26  Silver
1    Jin  25    Gold
2    Soo  28     Vip

### 3. Pandas를 이용한 기초통계

In [7]:
sales_data = {'Cosmetics':[300,274,150,524,211], 'Clothes':[773,654,655,496,98],'Groceries':[326,145,131,254,299],'Electronic Products':[458,667,123,512,850]}
index_list = ['2014','2015','2016','2017','2018']

a = pd.DataFrame(sales_data, index=index_list)
a

      Cosmetics  Clothes  Groceries  Electronic Products
2014        300      773        326                  458
2015        274      654        145                  667
2016        150      655        131                  123
2017        524      496        254                  512
2018        211       98        299                  850

In [15]:
#axis의 차이
#axis=0: 열별로 평균
#axis=1: 행별로 평균 

print('*axis=0')
print(a.mean())
print('\n')
print('*axis=1')
print(a.mean(axis=1))

*axis=0
Cosmetics              291.8
Clothes                535.2
Groceries              231.0
Electronic Products    522.0
dtype: float64


*axis=1
2014    464.25
2015    435.00
2016    264.75
2017    446.50
2018    364.50
dtype: float64

In [10]:
#표준편차 출력
a.std()

Cosmetics              142.246968
Clothes                263.483776
Groceries               88.845371
Electronic Products    270.187898
dtype: float64

In [16]:
a.describe()

        Cosmetics     Clothes   Groceries  Electronic Products
count    5.000000    5.000000    5.000000             5.000000
mean   291.800000  535.200000  231.000000           522.000000
std    142.246968  263.483776   88.845371           270.187898
min    150.000000   98.000000  131.000000           123.000000
25%    211.000000  496.000000  145.000000           458.000000
50%    274.000000  654.000000  254.000000           512.000000
75%    300.000000  655.000000  299.000000           667.000000
max    524.000000  773.000000  326.000000           850.000000

In [17]:
a[['Cosmetics','Clothes']] #Columns 기준

      Cosmetics  Clothes
2014        300      773
2015        274      654
2016        150      655
2017        524      496
2018        211       98

In [20]:
a.loc[['2015','2016']]  #Index 기준

      Cosmetics  Clothes  Groceries  Electronic Products
2015        274      654        145                  667
2016        150      655        131                  123

In [22]:
#원하는 Columns에서 필요한 Index 값만 도출할 때
a['Groceries'][['2017','2018']]

2017    254
2018    299
Name: Groceries, dtype: int64